#Задача 6: Сумма элементов списка
# 1. Напишите функцию sum_list(numbers)
# 2. Принимает список чисел
# 3. Возвращает их сумму (используйте sum())
#
# Примеры:
# sum_list([1, 2, 3, 4, 5]) → 15
# sum_list([10, 20, 30]) → 60
# sum_list([100]) → 100


# def sum_list(number):
#     print(sum(number))